***** Notes on file system attributtes
#+begin_quote
In Linux, there are total of nine mode bits that set the basic access
permissions. The first three bits set the permissions for the owner of the file.
The next three bits set the permissions for the members of the file’s group. The
last three bits set the permissions for everyone else on the system:
#+end_quote

Thus the maximum numeric value for each field is
#+begin_src python :results output
print(int("111", 2))
#+end_src

#+RESULTS:
: 7


